app/controllers/api/sessions_controller.rb

UPDATE `users` SET `current_sign_in_at` = '2014-12-01 00:06:21', `current_sign_in_ip` = '128.54.236.49', `last_sign_in_at` = '2014-12-01 00:02:14', `last_sign_in_ip` = '128.54.234.39', `sign_in_count` = 52, `updated_at` = '2014-12-01 00:06:21' WHERE `users`.`id` = 2
---
  def create
    case params[:request]
    when "login"
       if not current_user.nil?
           render :status => 200,
                  :json => { :success => true,
                             :info => "Logged in",
                             :data => { :balance => current_user.savings_balance} }
       else
           render :json => {}.to_json, :success => false
       end
    when "update_balance"
       if not current_user.nil?
           User.transaction do
              @user = current_user
              puts "current user balance: ", @user.savings_balance
              savings_diff = params[:balance].to_f
              puts "amount to add: ", savings_diff
              @user.savings_balance= @user.savings_balance + savings_diff
              puts "current user balance: ", @user.savings_balance
              @user.save