app/controllers/users_controller.rb

  def index
    puts 'INDEX'
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `password`, `updated_at`, `username`) VALUES ('2014-10-31 21:00:59', 'ilovecheese', '2014-10-31 21:00:59', 'wes')

  def update
    @user =  set_user

#if @user.update_attributes(params[:user])
=begin    if @user.update_attributes(user_params)
---
UPDATE `users` SET `checkings_balance` = -1817.0, `savings_balance` = 536.53, `updated_at` = '2014-11-10 11:05:15' WHERE `users`.`id` = 2